Revit 2024 API
FilterGlobalParameterAssociationRule Class
 A filter rule that operates on global parameters ElementId values in a Revit project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public class FilterGlobalParameterAssociationRule : FilterNumericValueRule
Visual Basic
Public Class FilterGlobalParameterAssociationRule _
	Inherits FilterNumericValueRule
Visual C++
public ref class FilterGlobalParameterAssociationRule : public FilterNumericValueRule
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.FilterRule
 Autodesk.Revit.DB.FilterValueRule
 Autodesk.Revit.DB.FilterNumericValueRule
 Autodesk.Revit.DB.FilterGlobalParameterAssociationRule
See Also
FilterGlobalParameterAssociationRule Members
Autodesk.Revit.DB Namespace